//#include <stdio.h>
//
//int main() {
//	//int a = 2 + 3; = 5
//	//int a = 2 - 5; = -3
//	//int a = 4 * 200; = 800
//
//	int a = 10 / 3; // 3 ... 몫
//	printf("10 / 3 = int %d\n", a);
//
//	int b = 9.0 / 3.0; // 3.0 --> 3
//	printf("9.0 / 3.0 = int %d\n", b);
//
//	int c = 100.0 / 30.0; // 3.33 --> 3
//	printf("100.0 / 30.0 = int %d\n", c);
//
//	double d = 100 / 30; // 3 --> 3.0
//	printf("100 / 30 = double %f\n", d);
//
//	double e = (double) 100 / 30.0; 
//	// 실수 & 정수 연산 = 모두 실수로
//	// 3.33 -> 3.33
//
//	printf("100 / 30.0 = %f\n", e);
//
//
//	/*** 나머지 연산 :: 정수 ***/ 
//	// 나눗셈 = 몫 + 나머지
//
//	int f = 10 % 3;
//	printf("10 % 3 = %d\n", f); // 1
//
//	int g = 14 % 2;
//	printf("14 % 2 = %d\n", g); // 0
//
//	int h = 17 % 1;
//	printf("17 % 1 = %d\n", h); // 0
//
//	return 0;
//}