//#include <stdio.h>
//
//int main() {
//
//	int hungry = 7; // ¹è°¡ °íÇÁ´Ù
//	int meat = 8;	// »ï°ã»ìÀÌ ¸Ô°í ½Í´Ù
//
//	if (hungry == 7 && meat == 8) {
//		printf("»ï°ã»ì ÁýÀ¸·Î Á÷Áø");
//	}
//
//	/*
//		Àú´Â ¹è°¡ °íÇÁ°í, »ï°ã»ìÀ» ¸Ô°í ½Í¾î¿ä. >> »ï°ã»ì Áý
//		Àú´Â ¹è°¡ °íÇÂµ¥, »ï°ã»ìÀº ¾È ¸Ô°í ½Í¾î¿ä. >> X
//		Àú´Â ¹è°¡ ¾È°íÇÂµ¥, »ï°ã»ìÀ» ¸Ô°í ½ÍÀ¸¸é.. >> X
//		Àú´Â ¹èµµ ¾È°íÇÁ°í, »ï°ã»ìµµ ¾È ¸Ô°í ½Í¾î¿ä >> X
//		hungry = 1, meat = 1        
//		hungry = 0, meat = 0
//	*/
//	return 0;
//}